app/views/homes/index.html.erb


<% if current_user.role.present? && current_user.role.name=="admin"%>
---
SELECT "roles".* FROM "roles" WHERE "roles"."user_id" = 2 LIMIT 1