app/controllers/homes_controller.rb

  def index
    @homes = Home.all
    @users = User.all
---
SELECT `homes`.* FROM `homes`
SELECT "users".* FROM "users"

  def show
    @home = Home.find(params[:id])
---
SELECT "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT 1  [["id", "3"]]